#!/bin/bash

#######################################################################
# 用途： 开始启动脚本，先执行本脚本
#
#
# 输入项目名称，并执行./main.sh脚本，生成新项目
#######################################################################

## 初始化项目数
projects='';
dbname='';


## 输入项目数量和项目数据库名称
read -p "请输入需创建的项目数: " projects;

for ((i=0; i<$projects; i++))
do
	read -p "请输入创建的项目数据库名称(e.g: test):" dbname[$i] 
done



## step1: 初始化开始，循环调用main.sh，生成框架和配置最终项目
echo -e "\n=============== ......初始化正在开始...... ===============\n";

for ((i=0; i<$projects; i++))
do
	# echo "第$i个元素: ${dbname[$i]}"
	./1-main.sh ${dbname[$i]};
done



## step2: 配置域名
echo -e "\n=============== ......正在开始配置域名...... ===============\n";

for ((i=0; i<$projects; i++))
do
	sudo ./8-hosts_nginx.sh ${dbname[$i]}
done